Reports/Чемпионы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Чемпионы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лига</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОчков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чемпионат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗабито</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЗабито</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПропущено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЗабито</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/Итоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Итоги</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗабито</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПропущено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Туры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Туры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Чемпионы/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ДанныеПолучить()
	Если НЕ ЗначениеЗаполнено(Лига()) Тогда Возврат; КонецЕсли;
	
	Отчет.Данные.Очистить();
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	                      |	Чемпионы.Чемпионат КАК Чемпионат,
	                      |	ГОД(Чемпионы.Период) КАК Год,
	                      |	Чемпионы.Команда КАК Команда,
	                      |	Чемпионы.КоличествоОчков КАК КоличествоОчков,
	                      |	Чемпионы.КоличествоЗабито - Чемпионы.КоличествоПропущено КАК Разница,
	                      |	Чемпионы.КоличествоЗабито КАК КоличествоЗабито,
	                      |	Чемпионы.КоличествоПропущено КАК КоличествоПропущено
	                      |ИЗ
	                      |	РегистрСведений.Итоги КАК Чемпионы
	                      |ГДЕ
	                      |	Чемпионы.Место = 1
	                      |	И Чемпионы.Чемпионат.Владелец = &Лига
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Год УБЫВ");
	Запрос.УстановитьПараметр("Лига",			Лига());
	Если ПростойОтчет Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Чемпионы.Чемпионат КАК Чемпионат,
		               |	ГОД(Чемпионы.Период) КАК Год,
		               |	Чемпионы.Команда КАК Команда,
		               |	Чемпионы.КоличествоОчков КАК КоличествоОчков,
		               |	Чемпионы.КоличествоЗабито - Чемпионы.КоличествоПропущено КАК Разница,
		               |	Чемпионы.КоличествоЗабито КАК КоличествоЗабито,
		               |	Чемпионы.КоличествоПропущено КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрСведений.Итоги КАК Чемпионы
		               |ГДЕ
		               |	Чемпионы.Чемпионат.Владелец = &Лига
		               |	И Чемпионы.Место = 1
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Год УБЫВ";
	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Чемпионы.Чемпионат КАК Чемпионат,
		               |	ГОД(Чемпионы.Период) КАК Год,
		               |	ВЫБОР
		               |		КОГДА Чемпионы.Команда = &Команда
		               |			ТОГДА Чемпионы.Команда
		               |		ИНАЧЕ NULL
		               |	КОНЕЦ КАК Команда,
		               |	ВЫБОР
		               |		КОГДА Чемпионы.Команда = &Команда
		               |			ТОГДА Чемпионы.КоличествоОчков
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК КоличествоОчков,
		               |	ВЫБОР
		               |		КОГДА Чемпионы.Команда = &Команда
		               |			ТОГДА Чемпионы.КоличествоЗабито - Чемпионы.КоличествоПропущено
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Разница,
		               |	ВЫБОР
		               |		КОГДА Чемпионы.Команда = &Команда
		               |			ТОГДА Чемпионы.КоличествоЗабито
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК КоличествоЗабито,
		               |	ВЫБОР
		               |		КОГДА Чемпионы.Команда = &Команда
		               |			ТОГДА Чемпионы.КоличествоПропущено
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрСведений.Итоги КАК Чемпионы
		               |ГДЕ
		               |	(Чемпионы.Чемпионат, ГОД(Чемпионы.Период)) В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 21
		               |				Чемпионаты.Чемпионат КАК Чемпионат,
		               |				ГОД(Чемпионаты.Период) КАК Год
		               |			ИЗ
		               |				РегистрСведений.Итоги КАК Чемпионаты
		               |			ГДЕ
		               |				Чемпионаты.Чемпионат.Владелец = &Лига
		               |			УПОРЯДОЧИТЬ ПО
		               |				Год УБЫВ)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Команда УБЫВ,
		               |	Год";
		Запрос.УстановитьПараметр("Команда",		Отчет.Команда);
	КонецЕсли;
	Выборка		= Запрос.Выполнить().Выбрать();
	Чемпионаты	= Новый Массив;
	
	Если ПростойОтчет Тогда
		Пока Выборка.Следующий() Цикл
			Если Чемпионаты.Найти(Выборка.Чемпионат) = Неопределено Тогда
				Чемпионаты.Добавить(Выборка.Чемпионат);
				
				ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда) Тогда
		Пока Выборка.Следующий() И Выборка.Команда = Отчет.Команда Цикл
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
		КонецЦикла;
		
	Иначе
		Кондуит		= Новый Массив;
		Пока Выборка.Следующий() Цикл
			Чемпионаты.Добавить(Выборка.Чемпионат);
			Если Кондуит.Найти(Выборка.Команда) = Неопределено Тогда
				Кондуит.Добавить(Выборка.Команда);
			КонецЕсли;
		КонецЦикла;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГОД(Туры.Владелец.ДатаОкончания) КАК Год,
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда В(&Команды)
		               |	И Туры.Владелец В(&Чемпионаты)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	ГОД(Туры.Владелец.ДатаОкончания)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Год,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Чемпионаты",		Чемпионаты);
		Запрос.УстановитьПараметр("Команды",		Кондуит);
		Выборка	= Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Лига(Чемпионат=Неопределено)
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Возврат СерверныйФункции.Лига(Чемпионат);
	ИначеЕсли НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Чемпионаты.Владелец КАК Лига,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА ЧемпионатыКоманды.Команда = &Команда
		                      |				ТОГДА 1
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ) КАК Порядок
		                      |ИЗ
		                      |	Справочник.Чемпионаты КАК Чемпионаты
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		                      |		ПО Чемпионаты.Ссылка = ЧемпионатыКоманды.Ссылка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Чемпионаты.Владелец
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Чемпионаты.Владелец.ОлимпийскаяСистема,
		                      |	Порядок УБЫВ");
		Запрос.УстановитьПараметр("Команда",			СерверныйФункции.МояКомандаПолучить());
		Выборка	= Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Отчет.Лига	= Выборка.Лига;
		КонецЕсли;
	КонецЕсли;
	Возврат Отчет.Лига;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДоступностьУстановить()
	Элементы.ТипГрафика.Доступность					= (НЕ ПростойОтчет);
	Элементы.ОтображатьТаблицуДанных.Доступность	= (НЕ ПростойОтчет);
	Элементы.График.Видимость						= (НЕ ПростойОтчет);
	Элементы.ГруппаРезультат.Видимость				= ПростойОтчет;
	График.ОбластьПостроения.ОтображатьТаблицуДанных	= ОтображатьТаблицуДанных;
КонецПроцедуры

&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат СерверныйФункции.ЦветКоманды(Команда);
КонецФункции

&НаСервере
Функция УстановитьСерию(Команда)
	Если ПростойОтчет Тогда
		Серия	= График1.УстановитьСерию(Команда);
	Иначе
		Серия	= График.УстановитьСерию(Команда);
	КонецЕсли;
	Серия.Расшифровка	= Команда;
	Если НЕ Серия.ПриоритетЦвета Тогда
		Цвет	= Цвет(Команда);
		Если ЗначениеЗаполнено(Цвет) Тогда
			Серия.Цвет			= Цвет;
			Серия.ПриоритетЦвета= Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Серия;
КонецФункции

&НаСервере
Функция ШагШкалы()
	Возврат ?(ТипГрафика = 0, 2 * Отчет.Лига.Владелец.Победа, 10);
КонецФункции

&НаСервере
Процедура ГрафикОбновить(ТолькоГрафик=Ложь)
	Если НЕ ТолькоГрафик Или Отчет.Данные.Количество() = 0 Тогда
		ДанныеПолучить();
	КонецЕсли;
	Если ПростойОтчет Тогда
		СформироватьНаСервере();
		
		График1.Очистить();
		мКоманды	= Новый Соответствие;
		Для Каждого Детали Из Отчет.Данные Цикл
			Серия		= мКоманды.Получить(Детали.Команда);
			Если График1.Точки.Количество() = 21 Тогда
				Прервать;
			ИначеЕсли Серия = Неопределено Тогда
				Серия	= УстановитьСерию(Детали.Команда);
				
				мКоманды.Вставить(Детали.Команда, Серия);
			КонецЕсли;
			Точка		= График1.УстановитьТочку(ФорматЧГ(Детали.Год));
			Точка.Расшифровка	= Детали.Команда;
			График1.УстановитьЗначение(Точка, Серия, ?(Отчет.Лига.ОлимпийскаяСистема, Детали.КоличествоЗабито, Детали.КоличествоОчков));
		КонецЦикла;
			
	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда) Тогда
		График.Очистить();
		График.ОбластьЛегенды.Расположение	= ?(ТипГрафика = 0, РасположениеЛегендыДиаграммы.Нет, РасположениеЛегендыДиаграммы.Авто);
		График.ОбластьЗаголовка.Текст = "";
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ШагШкалы();
		Для Каждого Детали Из Отчет.Данные Цикл
			Если ТипГрафика = 0 Тогда
				График.УстановитьЗначение(График.УстановитьТочку(ФорматЧГ(Детали.Год)), УстановитьСерию(Детали.Команда), Детали.КоличествоОчков);
			Иначе
				График.УстановитьЗначение(График.УстановитьТочку(ФорматЧГ(Детали.Год)), График.УстановитьСерию("Забито"), Детали.КоличествоЗабито);
				График.УстановитьЗначение(График.УстановитьТочку(ФорматЧГ(Детали.Год)), График.УстановитьСерию("Пропущено"), Детали.КоличествоПропущено);
			КонецЕсли;
		КонецЦикла;
	Иначе
		График.Очистить();
		График.ОбластьЛегенды.Расположение	= РасположениеЛегендыДиаграммы.Авто;
		График.ОбластьЗаголовка.Текст = ?(ТипГрафика = 2, "Меньше - лучше", "");
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ШагШкалы();
		Год			= 0;
		мКоманды	= Новый Соответствие;
		Для Каждого Детали Из Отчет.Данные Цикл
			Серия		= мКоманды.Получить(Детали.Команда);
			Если Серия = Неопределено Тогда
				Серия		= УстановитьСерию(Детали.Команда);
				
				мКоманды.Вставить(Детали.Команда, Серия);
			КонецЕсли;
			Если Год <> Детали.Год Тогда
				Год			= Детали.Год;
				Точка		= График.УстановитьТочку(ФорматЧГ(Детали.Год));
			КонецЕсли;
			График.УстановитьЗначение(Точка, Серия, ?(ТипГрафика = 1, Детали.КоличествоЗабито, ?(ТипГрафика = 2, Детали.КоличествоПропущено, Детали.КоличествоОчков)));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Команда.СписокВыбора, Кеш);
КонецПроцедуры

&НаСервере
Процедура ЛигаПриИзмененииНаСервере()
	КомандыЛиги.ЗагрузитьЗначения(?(ЗначениеЗаполнено(Отчет.Лига), СерверныйФункции.КомандыЛиги(Отчет.Лига, Истина), Новый Массив));
	Элементы.Команда.СписокВыбора.ЗагрузитьЗначения(КомандыЛиги.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент=Неопределено)
	ЛигаПриИзмененииНаСервере();
	ВидимостьДоступностьУстановить();
	Если НЕ ПростойОтчет Тогда
		ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЛигаПриИзменении();
	КомандаПриИзменении();
	ГрафикОбновить();
КонецПроцедуры

&НаСервере
Процедура ТипГрафикаЗагрузить()
	Элементы.ТипГрафика.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		ТипГрафика = Мин(1, ТипГрафика);
		
		Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Количество очков");
		Элементы.ТипГрафика.СписокВыбора.Добавить(1, "Количество голов",, БиблиотекаКартинок.Goal);
	Иначе
		Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Количество очков");
		Элементы.ТипГрафика.СписокВыбора.Добавить(1, "Забито голов",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(2, "Пропущено голов",, БиблиотекаКартинок.Goal);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		Если ЗначениеЗаполнено(Параметры.Лига) Тогда
			Отчет.Лига		= Параметры.Лига;
			ПростойОтчет	= Истина;
			ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Лига") И Отчет.Лига = Параметр Тогда
		ПодключитьОбработчикОжидания("КомандаСформировать", 0.1, Истина);
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") И Отчет.Лига = Лига(Параметр) Тогда
		ПодключитьОбработчикОжидания("КомандаСформировать", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "Чемпионат") = 0 Тогда
		ПодключитьОбработчикОжидания("КомандаСформировать", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТаблицуДанныхПриИзменении(Элемент=Неопределено)
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафикаПриИзменении(Элемент)
	ГрафикОбновить(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент=Неопределено)
	ТипГрафикаЗагрузить();
	Если Элемент <> Неопределено Тогда
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать() Экспорт
	Сформировать();
КонецПроцедуры
